# ===== Taps =====
tap "homebrew/services"
tap "majorcontext/moat"
tap "stripe/stripe-cli"
tap "yt-dlp/taps"

# ===== Shell & System =====
brew "bash"
brew "rsync"
brew "wget"

# ===== Languages & Runtimes =====
brew "go"
brew "node"
brew "pnpm"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "ruby"
brew "ruby-install"
brew "rust"

# ===== Build Tools =====
brew "automake"
brew "bison"
brew "cmake"
brew "ninja"
brew "pkgconf"

# ===== Database =====
brew "mysql"
brew "postgresql@15", restart_service: :changed
brew "sqlite-utils", link: false

# ===== Networking & Security =====
brew "gnutls"
brew "nmap"
brew "openssl@3"
brew "unbound"

# ===== Search & Navigation =====
brew "fzf"
brew "ripgrep"

# ===== Media & Documents =====
brew "aom"
brew "ffmpeg"
brew "ghostscript"
brew "imagemagick"
brew "jpeg-xl"
brew "ocrmypdf"
brew "poppler"

# ===== Development Tools =====
brew "clang-format"
brew "gh"
brew "git-filter-repo"
brew "hugo"
brew "openapi-generator"
brew "swiftlint"
brew "watchman"

# ===== AI & Data =====
brew "numpy"
brew "openblas"
brew "openvino"
brew "yt-dlp"
brew "majorcontext/moat/moat"

# ===== Libraries (transitive / project deps) =====
brew "certifi"
brew "chruby"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "edencommon"
brew "fb303"
brew "fbthrift"
brew "fizz"
brew "folly"
brew "gdbm"
brew "glib"
brew "harfbuzz"
brew "leptonica"
brew "libass"
brew "libffi"
brew "librist"
brew "libyaml"
brew "openjdk@11"
brew "pango"
brew "tesseract"
brew "wangle"

# ===== Other CLIs =====
brew "stripe/stripe-cli/stripe"

# ===== Casks =====
cask "android-platform-tools"
cask "bitwarden"
cask "codex"
cask "docker-desktop"
cask "emacs-app"
cask "mitmproxy"
cask "swiftbar"
cask "xbar"
# note: claude-code is installed via https://claude.ai/download, not brew

# ===== VS Code Extensions =====
vscode "alexcvzz.vscode-sqlite"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.heygithub"
vscode "golang.go"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-sqlite"
vscode "openai.chatgpt"
vscode "saoudrizwan.claude-dev"
vscode "shopify.ruby-lsp"
vscode "swiftlang.swift-vscode"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"

# ===== Go Packages =====
go "golang.org/x/tools/gopls"
go "github.com/deepmap/oapi-codegen/v2/cmd/oapi-codegen"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/go-swagger/go-swagger/cmd/swagger"

# ===== Cargo Packages =====
cargo "httpjail"
cargo "n2"
